DataProcessors/КорректировкаСобранныхСборок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>КорректировкаСобранныхСборок</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КатегорииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КатегорииОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВСборке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВСборке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Собрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСобрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныКорректировкиСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сборка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ОткорректированныеРегламентомСобранныеСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОткорректированныеРегламентомСобранныеСборки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Напечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КорректировкаСборки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаСборкиЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашаДоставка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НазваниеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НазваниеБазы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Альметьевск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Владимир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воронеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воронеж2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Восток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казань</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казань2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Калуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Киров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Краснодар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Краснодар2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Липецк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Молодогвардейская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НабережныеЧелны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НижнийНовгород</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пенза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятигорск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ростов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ростов2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рязань</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Саранск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Север</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тамбов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тверь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тула</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ульяновск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чебоксары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шахты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮГ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ярославль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныКорректировкиСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныКорректировкиСборки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пересорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недопоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИстекСрокРезервирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКратности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/КорректировкаСобранныхСборок/Ext/ObjectModule.bsl
Процедура КорректировкаСобранныхСборок() Экспорт
	
	ОтправлятьПочту = Истина;
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();	
	
	Если Константы.НеОтправлятьПочту.Получить() ИЛИ НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОтправлятьПочту = Ложь;
	КонецЕсли;
	
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);	
	Почта = Новый ИнтернетПочта; 
	
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		ОтправлятьПочту = Ложь;  
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(КатегорииОбъектов.Объект КАК Справочник.ФизическиеЛица) КАК ФизЛицо
	|ПОМЕСТИТЬ ФизЛица
	|ИЗ
	|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|ГДЕ
	|	КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ОтправлятьОтчетОКорректировкеСтарыхСборок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФизЛица.ФизЛицо,
	|	КонтактнаяИнформация.Представление КАК ЭлАдрес
	|ИЗ
	|	ФизЛица КАК ФизЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ФизЛица.ФизЛицо = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailРабочийФизическогоЛица))";

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОтправлятьПочту = Ложь;
	КонецЕсли;
	
	ТаблицаПолучателейПисьма = РезультатЗапроса.Выгрузить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Константы.ЧислоДнейДляРегламентаПоКорректировкамСобранныхСборок КАК ЧислоДней
	|ПОМЕСТИТЬ КонстантаЧислоДней
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыВСборкеОстатки.Сборка
	|ПОМЕСТИТЬ ТаблСборок
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке.Остатки(
	|			,
	|			ВЫБОР
	|				КОГДА Сборка.ДатаДоставкиКлиенту = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА ЗаказПокупателя.Дата
	|				ИНАЧЕ Сборка.ДатаДоставкиКлиенту
	|			КОНЕЦ МЕЖДУ &ДатаНач И &ДатаКон
	|				И Сборка.ДокументСобранИУпакован = ИСТИНА
	|				И Сборка.Дата < &МинДатаСборки
	|				И Сборка.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособДоставки.Самовывоз)) КАК ТоварыВСборкеОстатки,
	|	КонстантаЧислоДней КАК КонстантаЧислоДней
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТоварыВСборкеОстатки.Сборка.ДатаДоставкиКлиенту = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ТоварыВСборкеОстатки.ЗаказПокупателя.Дата
	|			ИНАЧЕ ТоварыВСборкеОстатки.Сборка.ДатаДоставкиКлиенту
	|		КОНЕЦ < ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, ВЫБОР
	|				КОГДА ТоварыВСборкеОстатки.Сборка.Договор.ДержатьРезервБезОплатыОграниченноеВремя
	|						И ТоварыВСборкеОстатки.Сборка.Договор.ЧислоДнейРезерваБезОплаты > КонстантаЧислоДней.ЧислоДней
	|					ТОГДА ТоварыВСборкеОстатки.Сборка.Договор.ЧислоДнейРезерваБезОплаты
	|				ИНАЧЕ КонстантаЧислоДней.ЧислоДней
	|			КОНЕЦ * -1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблСборок.Сборка,
	|	ЕСТЬNULL(РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Дата, ДОБАВИТЬКДАТЕ(ТаблСборок.Сборка.Дата, МИНУТА, 1)) КАК Дата
	|ИЗ
	|	ТаблСборок КАК ТаблСборок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|		ПО ТаблСборок.Сборка = РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки
	|			И (РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Проведен)";

	ЧислоДней = Константы.ЧислоДнейДляРегламентаПоКорректировкамСобранныхСборок.Получить();
	Запрос.УстановитьПараметр("ДатаНач", ДобавитьМесяц(ТекущаяДата() - ЧислоДней * 60 * 60 * 24, -3));
	Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата() - ЧислоДней * 60 * 60 * 24); 
	Запрос.УстановитьПараметр("МинДатаСборки", НачалоДня(ТекущаяДата() - 86400));  
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОтправлятьПочту = Ложь;
	КонецЕсли;
	
	//+Бабчинецкий А.С. 14.04.2025 #UT10-5195
	МеняемЯчейку = Константы.База.Получить() = Перечисления.НазваниеБазы.Казань 
					Или Константы.База.Получить() = Перечисления.НазваниеБазы.НабережныеЧелны
					Или Константы.База.Получить() = Перечисления.НазваниеБазы.Казань2
					Или Константы.База.Получить() = Перечисления.НазваниеБазы.Чебоксары
					Или Константы.База.Получить() = Перечисления.НазваниеБазы.Ульяновск
					Или Константы.База.Получить() = Перечисления.НазваниеБазы.Альметьевск;
	//-Бабчинецкий А.С. 14.04.2025 #UT10-5195
					
	Если МеняемЯчейку Тогда
		ЯчейкаДляОтказов = Константы.ЯчейкаДляПеремещенияОтказовКлиентов.Получить();
	Иначе
		ЯчейкаДляОтказов = Неопределено;
	КонецЕсли;
	
	ОбщаяТаблица = Новый ТабличныйДокумент;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокОбъект = Документы.КорректировкаСборкиЗаказовПокупателя.СоздатьДокумент();
		ДокОбъект.Заполнить(Выборка.Сборка);
		ДокОбъект.Исполнено = Истина;
		ДокОбъект.Комментарий = "Создан регламентным заданием по корректировке собранных сборок";
		
		Для Каждого Стр Из ДокОбъект.Товары Цикл
			
			Стр.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика;
			
			Если МеняемЯчейку И ЗначениеЗаполнено(ЯчейкаДляОтказов) Тогда
				Стр.Ячейка = ЯчейкаДляОтказов;
			КонецЕсли;

		КонецЦикла;
		
		Если ЗначениеЗаполнено(Выборка.Дата) Тогда
			ДокОбъект.Дата = Выборка.Дата - 1;
		КонецЕсли;
		
		Если ДокОбъект.Товары.Количество() Тогда
			
			ДокОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета", Истина);
			
			Попытка
				
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				ДокОбъект.СоздатьКорректировкиЗаказа();
				
			Исключение
				Продолжить;
			КонецПопытки;
			
			МЗ = РегистрыСведений.ОткорректированныеРегламентомСобранныеСборки.СоздатьМенеджерЗаписи();
			МЗ.КорректировкаСборки = ДокОбъект.Ссылка;
			МЗ.Напечатан = Ложь;
			МЗ.ДатаЗаписи = ТекущаяДата();
			МЗ.Записать();
			
			Если ОтправлятьПочту Тогда
				
				ТабДок = ДокОбъект.ПечатьЗаданияНаРазбор();
				ОбщаяТаблица.Вывести(ТабДок);
				
			КонецЕсли;		
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОтправлятьПочту Тогда
		
		ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
		СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
		ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
		ОбщаяТаблица.Записать(ВременныйКаталог + "КорректировкаСборки.XLSX", ТипФайлаТабличногоДокумента.XLSX);
		
		Для Каждого ТекСтр Из ТаблицаПолучателейПисьма Цикл
				
			Сообщение = Новый ИнтернетПочтовоеСообщение;
			Сообщение.Тема = "Корректировка сборки!";
			
			МылоКонтрагента = ТекСтр.ЭлАдрес;
						
			МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(МылоКонтрагента, ";");
			
			Для каждого ТекАдрес Из МассивАдресов Цикл
				Сообщение.Получатели.Добавить(ТекАдрес); 
			КонецЦикла;
				
			Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
			Сообщение.Вложения.Добавить(ВременныйКаталог + "КорректировкаСборки.XLSX", ТипФайлаТабличногоДокумента.XLSX);
			
			Попытка
				
				Почта.Послать(Сообщение);
				Сообщение.Вложения.Очистить(); 
				ТекстСообщения = "Отправлено письмо " + ТекСтр.ФизЛицо + " на адрес " + МылоКонтрагента + " с уведомлением о корректировке сборки";
				ЗаписьЖурналаРегистрации("Отправка электронной почты.Успешно", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);	
				
			Исключение	  												
			КонецПопытки;
			
		КонецЦикла;
		
		Попытка
			УдалитьФайлы(ВременныйКаталог);
		Исключение  		
		КонецПопытки;
		
		Почта.Отключиться();
		
	КонецЕсли;

КонецПроцедуры
